W6D4_CW/SA_app/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE "artworks"."artist_id" = $1 AND "artwork_shares"."viewer_id" = $2  [["artist_id", 14], ["viewer_id", 14]]
---
  def index
    if params[:user_id]
      artworks = Artwork.joins(:artwork_shares).where(artworks:{ artist_id: params[:user_id] }, artwork_shares: { viewer_id: params[:user_id] })

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
UPDATE "artworks" SET "image_url" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["image_url", "www.citypiclight.com"], ["updated_at", "2019-11-21 22:48:21.871900"], ["id", 17]]
---
  def update
    artwork = Artwork.find(params[:id])

   if artwork.update(artwork_params)