W6D4_CW/SA_app/app/controllers/artworkshares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 15], ["viewer_id", 14], ["created_at", "2019-11-21 23:04:08.273808"], ["updated_at", "2019-11-21 23:04:08.273808"]]
---
  def create
    artworkshare = ArtworkShare.new(artworkshare_params)
    if artworkshare.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 24]]
---
  def destroy
    artworkshare = ArtworkShare.find(params[:id])

    artworkshare.destroy